{
	"We are open for testing! Schedule your Metabolic Efficiency Test now!" : "JEMI GATI PËR T’JU TESTUAR! CAKTO TERMININ TANI!",
	"Home" : "Për ne",
	"What we do" : "Çfarë bëjmë",
	"Performance" : "Performancë",
	"Health" : "Shëndet",
	"Athletic development" : "Zhvillim i sportistëve",
	"Sports nutrition" : "Nutricion sportiv",
	"Contact" : "Kontakti",

	"Don't just move – IMPROVE" : "PËRMIRËSOHU",
	"performance testing, program development & monitoring" : "testim i performancës, zhvillim i programit & monitorim",
	"Unlock your potential" : "Zhblloko potencialin",
	"Fueled for performance" : "Ushqyer për performancë",
	"PERSONALIZED PERFORMANCE NUTRITION" : "NUTRICION I PERSONALIZUAR PËR PERFORMANCË",
	"BASED ON YOUR UNIQUE ATHLETE PROFILE" : "BAZUAR NË PROFILIN TUAJ UNIK",
	"TRAINING PERIOD FOCUSED" : "FOKUSUAR NË PERIUDHËN E STËRVITJES",
	"Nothing can be more gratifying to an athlete than having everything you need to unlock greatness in one place!" : "Asgjë nuk mund të jetë më kënaqëse për një sportist sesa të kesh në një vend gjithçka që të duhet për të zhbllokuar madhështinë!",
	"At IMPROVE you can buy and order online professional nutritional supplements of the highest quality that are maximally effective, safe and doping free. We provide state of the art information regarding healthy nutrition, newest and most effective training methodologies for a better health, professional, semiprofessional and recreational athletes. Additionally, we offer testing services for both health- and performance-related testing using advanced equipment of the latest technology." : "Në IMPROVE ju mund të bleni dhe të porosisni shtesa ushqimore profesionale të cilësisë më të lartë që janë maksimalisht efektive, të sigurta dhe pa doping. Ne ofrojmë informatat më të fundit në lidhje me ushqimin e shëndetshëm, metodologjitë më të reja dhe më efektive të trajnimit për një shëndet më të mirë, sportistë profesionistë, gjysmë profesionistë dhe rekreativë. Për më tepër, ne ofrojmë shërbime testimi si për shëndetin ashtu edhe për performancën sportive, duke përdorur pajisje të avansuara të teknologjisë më të fundit.",
	"Nothing can be more gratifying to an athlete than having everything you need to unlock greatness in one place!" : "Asgjë nuk mund të jetë më kënaqëse për një sportist sesa të kesh në një vend gjithçka që të duhet për të zhbllokuar madhështinë!",

	"Our products" : "Produktet tona",

	"Level up with us!" : "Ngrite nivelin me ne!",
	"Find the perfect package for your personal performance needs!" : "Gjej pakon e përsosur për nevojat personale të performancës!",
	"Let's get started" : "Le të fillojmë",
	"View all products" : "Shiko të gjitha produktet",

	"Physiological Testing" : "Testimi Fiziologjik",
	"For a professional athlete, or those striving to be as such, sound training, based on scientific principles, is the only way to reach your potential and achieve your goals." : "Për një atlet profesionist, ose ata që përpiqen të bëhen të tillë, trajnimi i shëndoshë, i bazuar në parimet shkencore, është mënyra e vetme për të arritur potencialin dhe qëllimet tuaja.",
	"We apply physiological testing to determine training parameters and to measure how each athlete is adapting to their customized training plan." : "Ne aplikojmë testimin fiziologjik për të përcaktuar parametrat e stërvitjes dhe për të matur se si çdo atlet përshtatet me planin e tij të personalizuar të stërvitjes.",
	"Depending upon the needs and goals of the client, IMPROVE offers several types of tests based on sport specific needs." : "Në varësi të nevojave dhe qëllimeve të klientit, IMPROVE ofron disa lloje testesh bazuar në nevoja specifike sportive.",
	"Schedule a test with an expert" : "Schedule a test with an expert",

	"Clients testimonials" : "Deshmitë e klientëve",
	"The services and sports nutrition products are of the highest quality, and I see continuous improvement in my performance, in both training and competition." : "Shërbimet dhe produktet e nutricionit sportiv janë të cilësisë më të lartë, dhe unë shoh përmirësim të vazhdueshëm në performancën time, si në stërvitje ashtu edhe në garë.",
	"Volleyball Player" : "Lojtar i volejbollit",

	"We'd love to hear from you" : "Duam të dëgjojmë nga ju",
	"Whether you have a question about our services, testing, products, or anything else, our team is ready to answer all your questions" : "Nëse keni pyetje në lidhje me shërbimet tona, testimin, produktet ose ndonjë gjë tjetër, ekipi ynë është i gatshëm t'u përgjigjet të gjitha pyetjeve tuaja",
	"Get in touch" : "Na kontaktoni",

	"Visit us on social media" : "Na vizitoni në rrjetet sociale",
	"Select your preferred language below" : "Zgjedhni gjuhën tuaj të preferuar më poshtë",

	"Isa Boletini street, no. 24" : "Rr. Isa Boletini. Nr. 39",
	"10000 Prishtina, Republic of Kosovo" : "10000 Prishtinë, Republika e Kosovës"
}